[
    {
        "id": "1",
        "name": "Tale of the Darkroom III",
        "organizar": "AIUB Photography Club  ",
        "date": "30 January 2024",
        "day": "Tuesday",
        "description": "The echoes of creativity reverberated as ToD Season-III unfurled its wings to the world, where a staggering 8047 submissions were made by photographers representing more than 260 different universities. Among this diverse collection of amazing images, we received the most submissions in the 'Phone Category, totaling 4239 photos, followed by an impressive 3,323 photos in the 'Camera Category. In the ‘Story Category’, 81 were crafted. From amongst all of them, our panel of judges, Dr. Abdus Samad Alim, Mr. Kudrat E Khoda, and Mr. Khandaker Tanvir Murad, along with the curator of the event, Mr. Jewel Paul, rigorously scrutinized and selected 127 picture-perfect submissions to be exhibited at this year’s ToD at the Gallery 7 of National Art Gallery, Shipakala Academy, Dhaka.",
        "img": "https://www.aiub.edu/Files/Uploads/original/totdraiubpc24013.jpg",
        "location": "Aiub D-building"
    },
    {
        "id": "2",
        "name": "Boshonto Uthshob 1430",
        "organizar": "AIUB Performing Arts Club  ",
        "date": "27 February 2024",
        "day": "Tuesday",
        "description": "Keeping with the tradition, this year, the Office of Student Affairs (OSA) presented AIUB Performing Arts Club (APAC)’s “Boshonto Uthshob 1430”, adding its own verse to the symphony of festivities with a captivating concert dedicated to the spirit of Pohela Falgun on the 14th of February 2024. The evening air was filled with the rhythmic beats, the soulful melodies, and the playful tunes of Bengali songs and dances, old and new, as an incredible showcase of musical performances.",
        "img": "https://www.aiub.edu/Files/Uploads/original/boshontouthshob1430apacaiub2702202410.jpeg",
        "location": "Aiub-Amphitheatre"
    },
    {
        "id": "3",
        "name": "AIUB PREMIER LEAGUE",
        "organizar": "OfFice Of Sports",
        "date": "24 February 2024",
        "day": "saturday",
        "description": "On a lively Saturday, February 24, 2024, the AIUB Premier League (APL) T-10 Cricket Championship kicked off at AIUB's campus. The opening ceremony was graced by the presence of Professor Dr. Abdur Rahman, Pro Vice Chancellor of AIUB, Dr. Manzur H. Khan, Proctor of AIUB, who officiated the commencement of the event. They were joined by faculty members, and administrative officials of AIUB. With 24 departmental teams vying for victory, including national cricket stars like Sabbir Rahman, Shariful Islam, Joyraz Sheik Emon,  Munim Shahriar and Arafat Sunny, the tournament promised thrilling action",
        "img": "https://www.aiub.edu/Files/Uploads/original/aplt1001.jpg",
        "location": "Aiub playground"
    },
    {
        "id": "4",
        "name": "In remembrance of Ekushey",
        "organizar": "AIUB Oratory Club ",
        "date": "6 March 2024",
        "day": "Wednesday",
        "description": "The event commenced with poetry recitation. Later, members of AOC expressed their assertion to speak in their regional languages. An imaginary conversation between the language martyr Rafiq and Muhammad Ali Jinnah was presented by the AOC debaters that portrayed the passion and resilience of the language movement held in 1952. ",
        "img": "https://www.aiub.edu/Files/Uploads/original/inremembranceekusheyaoc0603202401.jpg",
        "location": "Aiub-Amphitheatre"
    },
    {
        "id": "5",
        "name": "Intra AIUB Programming Contest – 2024",
        "organizar": "AIUB Computer club (ACC)",
        "date": "28 March 2024",
        "day": "Thursday",
        "description": "AIUB Competitive Programmers' Community, in collaboration with the AIUB Computer Club, the Office of Student Affairs, and the Department of Computer Science, organized the Intra AIUB Programming Contest - 2024 Senior, Junior and Girls segment on March 1st and 2nd 2024. Encouraging participants to solve problems with remarkable intelligence and skill was the primary objective of this competition. The programming competition took place in the Computer Labs of the D Building, at the AIUB campus",
        "img": "https://www.aiub.edu/Files/Uploads/original/intraaiubprogrammingcontest2803202404.jpg",
        "location": "Aiub D-building"
    },
    {
        "id": "6",
        "name": "AIUB Boishakhi Ullash ",
        "organizar": "AIUB Performing Arts Club",
        "date": "14 April 2024",
        "day": "Thursday",
        "description": "Day-long Concert Student-run Stalls Road Painting and Campus Decoration",
        "img": "https://www.aiub.edu/Files/Uploads/falgun04.jpg",
        "location": "Aiub-Amphitheatre"
    },
    {
        "id": "7",
        "name": "AIUB CS FEST",
        "organizar": "AIUB Computer club (ACC)",
        "time": "10.00 Am",
        "date": "26 April 2024",
        "day": "Friday",
        "description": "The opening ceremony of the AIUB CS Fest 2024, presented by the Office of Student Affairs and organized by AIUB Computer Club with the support of Department of Computer Science, was held at 10:00 AM on Friday, April 26th, 2024, at the American International University-Bangladesh campus. The silver sponsor of the event is Brain Station 23, and another sponsor is Therap Bd. This is a flagship event and one of the largest festivals of AIUB, featuring twelve diverse segments with participation from AIUB students as well as numerous schools and colleges across the nation.",
        "img": "https://www.aiub.edu/Files/Uploads/original/aiubcsfest202402.jpg",
        "location": "Aiub campus"
    },
    {
        "id": "8",
        "name": "Rhetoric 1.0",
        "organizar": "AIUB Moot Court Club (AMCC)",
        "date": "5 May 2024",
        "day": "sunday",
        "description": "AIUB Moot Court Club (AMCC) recently organized a public speaking contest, named ‘Rhetoric 1.0’ on Wednesday, March 06, 2024, in the Media Studio of American International University-Bangladesh. The students of the Law Department participated in the event and showcased their exceptional oratory skills.",
        "img": "https://www.aiub.edu/Files/Uploads/original/aiubmootcourtrhetoric08.jpg",
        "location": "Aiub campus"
    },
    {
        "id": "9",
        "name": "AIUB INDOOR GAMES COMPETITION",
        "organizar": "OfFice Of Sports",
        "date": "5 May 2023",
        "day": "sunday",
        "description": " The American International University-Bangladesh (AIUB) has organized a 11-day long AIUB Indoor Games Competition 2022. The event was inaugurated by the Vice Chancellor of AIUB Dr. Carmen Z. Lamagna at AIUB Campus on Monday, 14 November 2022. Among o",
        "img": "https://www.aiub.edu/Files/Uploads/original/aiubindoor06.jpeg",
        "location": "Aiub D-building"
    },
    {
        "id": "10",
        "name": "The Banglalink Youth Fest",
        "organizar": "AIUB Performing Arts Club",
        "date": "6 August 2023",
        "day": "sunday",
        "description": "The music of our youth stays with us throughout our lives. It is an innate impact on our hearts and minds. It is what connects with our journeys, voices our emotions, and leaves an impression on our spirits. And with the aim of doing just that, the AIUB Performing Arts Club (APAC) in collaboration with Banglalink, organized an evening of incredible musical performances in the Banglalink Youth Fest, on the 2nd of August 2023, at the AIUB campus premises. ",
        "img": "https://www.aiub.edu/Files/Uploads/original/apacconaiub2307.jpg",
        "location": "Aiub-cumpus"
    },
    {
        "id": "11",
        "name": "Japanese Film Festival 2023",
        "organizar": "AIUB Film Club  ",
        "date": "6 April 2023",
        "day": "Thursday",
        "description": "To improve the cultural relationship between Japan and Bangladesh, the Embassy of Japan in Bangladesh organized a Japanese film festival at two different universities in the country - the University of Dhaka and the American International University – Bangladesh (AIUB). AIUB Film Club (AFC) facilitated this event at the American International University – Bangladesh (AIUB) on 12 March 2023. The screening was held in the multi-purpose hall, Building D.",
        "img": "https://www.aiub.edu/Files/Uploads/original/afcjapanaiub2307.jpg",
        "location": "Aiub D-building"
    },
    {
        "id": "12",
        "name": "Dexterity 2.0 Intra-AIUB Case Competition",
        "organizar": "AIUB Computer club (ACC)",
        "date": "9 August 2023",
        "day": "Wednesday",
        "description": "Our futures are created by what we do today, not tomorrow. Today is the opportunity to build the tomorrow we want. Our choices and efforts today determine and define the kind of future we are working towards, in business and even in education. Emphasizing on the bridging the gap with practical application, simulations, and a holistic approach to teaching-and-learning, the American International University-Bangladesh (AIUB) engages students in various initiatives throughout the semesters. Dexterity 2.0, an intra-AIUB case competition, is one such program organized by the AIUB Business Club (ABC).",
        "img": "https://www.aiub.edu/Files/Uploads/original/abcdexaiub2306.jpg",
        "location": "Aiub D-building"
    },
    {
        "id": "13",
        "name": "Dexterity 2.0 Intra-AIUB Case Competition",
        "organizar": "AIUB Computer club (ACC)",
        "date": "9 August 2023",
        "day": "Wednesday",
        "description": "Our futures are created by what we do today, not tomorrow. Today is the opportunity to build the tomorrow we want. Our choices and efforts today determine and define the kind of future we are working towards, in business and even in education. Emphasizing on the bridging the gap with practical application, simulations, and a holistic approach to teaching-and-learning, the American International University-Bangladesh (AIUB) engages students in various initiatives throughout the semesters. Dexterity 2.0, an intra-AIUB case competition, is one such program organized by the AIUB Business Club (ABC).",
        "img": "https://www.aiub.edu/Files/Uploads/original/abcdexaiub2306.jpg",
        "location": "Aiub D-building"
    },
    {
        "id": "14",
        "name": "AIUB Indoor Games Competition 2022",
        "organizar": "AIUB Office Of Sports",
        "date": "16 November 2022",
        "day": "Wednesday",
        "description": "The American International University-Bangladesh (AIUB) has organized a 11-day long AIUB Indoor Games Competition 2022. The event was inaugurated by the Vice Chancellor of AIUB Dr. Carmen Z. Lamagna at AIUB Campus on Monday, 14 November 2022. Among others, Deans, Directors and Heads of different departments, faculty members, high officials and students were also present at the inauguration. This year the Indoor games include Chess, Badminton, Basketball, Handball, Table Tennis, Tennis, Ludo, Carom, Billiard and Volleyball.",
        "img": "https://www.aiub.edu/Files/Uploads/original/aiubindoor01.jpeg",
        "location": "Aiub D-building"
    },
    {
        "id": "15",
        "name": "PROBHABOK 3.0",
        "organizar": "Department of Architecture",
        "date": "30 August 2022",
        "day": "Wednesday",
        "description": "Probhabok 3.0 was successfully organized by the Department of Architecture, AIUB and sponsored by Berger Paints Bangladesh Limited. It was a three-day event, at the multipurpose hall, Annex 7 of AIUB campus.",
        "img": "https://www.aiub.edu/Files/Uploads/original/probhabokimage004.jpg",
        "location": "Aiub Annex-7"
    },
    {
        "id": "16",
        "name": "STUDENT PHOTOGRAPHY COMPETITION",
        "organizar": "ARCHITECTURE DEPARTMENT OF AIUB",
        "date": "12 September 2022",
        "day": "Monday",
        "description": "Department of Architecture, AIUB, as part of its outreach program, organized a Student Photography Competition”, targeted towards school and College students. The theme of the competition was “bakshe bakshe bondi baksho” quoted from the album titled “Kolorob”  that is written by “Arnob/Mili” and “ Jadur Shohor” quoted from the album titled “ Jadur Shohor”, written by “ Sharmin Sultana Shumi”. 146 participants from different schools and colleges registered and submitted their photographs.  A spectacular “Award giving ceremony” was organized on Tuesday, 23rd August 2022 in AIUB permanent campus.",
        "img": "https://www.aiub.edu/Files/Uploads/original/exhibitionaiub006.jpg",
        "location": "Aiub D-building"
    },
    {
        "id": "17",
        "name": "AIUB CYBER GAMING FEST 2022",
        "organizar": "AIUB Computer club (ACC)",
        "date": "1 December 2022",
        "day": "Wednesday",
        "description": "Four-days-long “AIUB Cyber Gaming Fest-2022” was held at the American International University-Bangladesh (AIUB) from December 1 to December 4, 2022. It is an annual event organized by AIUB Computer Club (ACC) participated by the student gamers from numerous institutions of the country.",
        "img": "https://www.aiub.edu/Files/Uploads/original/cybergame2022003.jpg",
        "location": "Aiub Annex-3"
    }
]