[
    {
        "id": "1",
        "name": "AIUB ARTS CLUB (AAC)",
        "img": "https://www.aiub.edu/Files/Templates/NewAIUB/assets/images/onCampus/aac.png",
        "objective": "Established in 2006, the purpose of the AAC is to provide students with an opportunity to explore their creativity and artistic talents. The club aims to encourage students to explore their artistic talents, provide a platform for students to share their work with others, promote creativity and foster a sense of community among them.",
        "activites": "The club engages in a variety of activities, ranging from art workshops, competitions, and exhibitions, organizing and participating within and outside of the university. From commemorating the International Mother Language Day on the 21st of February to celebrating the Bengali New Year on Pahela Baishakh every year, AAC collaborates to express their creativity through strokes, colors, and shades to create awe-inspiring pieces of art.",
        "membership": "Membership of AAC is open to students from all 4 Faculties of the university, who are interested in art. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 96 proactive members working in AAC.",
        "leadership": "AAC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance, logistical facilitation, and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "AAC plans to expand its scope and reach as an artistic platform in the future. The club hopes to offer more constructive workshops, as well as opportunities for students to create incredible artwork, participate in competitions, and exhibit their work to the world."
    },
    {
        "id": "2",
        "name": "AIUB BUSNIESS CLUB (ABC)",
        "img": "https://www.aiub.edu/Files/Templates/NewAIUB/assets/images/onCampus/abc.jpg",
        "objective": "ABC was established in 2009 as a learning organization with the aim of providing students with the opportunity to learn about business, develop their entrepreneurial skills, and network with other students and professionals. The club works to equip students with the knowledge and skills they need to succeed in the business world, enabling them to develop their entrepreneurial spirit and leadership capabilities, building a network of business professionals and organizations to connect with, learn from, and collaborate.",
        "activites": "The club arranges numerous seminars, workshops, and competitions that explore new business ideas, case studies, presentation skills, leadership practices, career opportunities, etc. Their work enables students to undertake real-life simulations in managing people, market brands, handle finances, optimize logistics, and design initiatives.",
        "membership": "ABC is considered as a departmental club for the Faculty of Business Administration (FBA), but students from other Faculties are also encouraged to apply for the membership in order to enhance their business sense and capacities. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 77 proactive members working in ABC.",
        "leadership": "ABC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC), with the designations adapted to reflect business corporations more aptly. OSA provides overall guidance, logistical facilitation, and constant support to the EC for implementing the various events of the club, with cooperation from FBA.",
        "future_outlook": "ABC intends to broaden its horizon in the business landscape, with more flagship events that augment the students’ understanding and experience of real-life business scenarios, in hope of creating opportunities for further corporate collaborations that can enhance their expertise through productive sessions and challenging tournaments."
    },
    {
        "id": "3",
        "name": "AIUB COMMUNITY OF ENGINEERING STUDENTS (ACES)",
        "img": "https://www.aiub.edu/Files/Uploads/original/aces.jpg",
        "objective": "ACES envisions to be a professional student organization offering welfare and services for engineering students and help the community both academically and skillfully. Since they began their journey in 2014, the club has focused on enabling the engineering community grow by working to expand engineering awareness through its programs and events, facilitate the professional advancement of all engineering students, develop the quality of life of disadvantaged communities through implementation of environmentally and economically sustainable engineering projects, and creating transformative experiences and responsible leaders.",
        "activites": "ACES has always put in efforts to bridge the gap between the university and industries, provide opportunities for its members to make contributions to their local and global communities, honor outstanding engineering students who have excelled in character, leadership skills, and volunteer activities through competitive events, and conduct insightful seminars and workshops that will benefit the engineering students to build better and sustainable future for themselves and the society.",
        "membership": "ACES was established as a student organization where students from both the Faculty of Engineering (FE) and the Faculty of Science & Technology (FST) are encouraged to apply for the membership. Recruitments are conducted bi-annually, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 255 proactive members working at ACES.",
        "leadership": "ACES operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC), using corresponding designations. Together in coordination with FE, OSA provides overall guidance, logistical facilitation, and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "ACES is working towards a world in which the communities we serve have the capacity to sustainably meet their basic human needs and that our members have enriched global perspectives through innovative professional educational opportunities."
    },
    {
        "id": "4",
        "name": "AIUB COMPUTER CLUB (ACC)",
        "img": "https://www.aiub.edu/Files/Uploads/original/acc-logo.jpg",
        "objective": "ACC commenced in 2012 with the idea of creating a platform for students to spread out the light of technology, building skills in various sectors including Content Writing, Photojournalism, Video Editing, Event Organizing, Volunteering, Development, UI/UX Design, and Graphic Design, connect with a community of members, alumni, and faculties in order to learn about the demanding skills of the current and future professional domain, and organize programs that train and test their aptitudes in the field of computer science.",
        "activites": "ACC is an infusion of a diverse set of interests existing within the students of science and IT, enhancing the educational learning with value-added trainings, workshops, and seminars for the members. Their events entail numerous activities like programming contests, gaming tournaments, idea/concept presentations, mobile, web, & desktop app showcases, and networking contests, collaborating with established brands of the tech industry like Microsoft, Oracle, Cisco, etc. ACC engages in several flagship events like the Computer Science Festival, Cyber-Gaming Fest, Jarvis, etc., besides their regular seminars and workshops. Keeping attuned with the industry trends, ACC collaborates with various organizations like Mozilla Bangladesh, Microsoft Student Partner, BASIS Student Forum.",
        "membership": "ACC is considered as a departmental club for the Faculty of Science (FST), but students from the Faculty of Engineering (FE) are also encouraged to apply for the membership. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 130 proactive members working at ACC.",
        "leadership": "ACC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). Together in coordination with FST, OSA provides overall guidance, logistical facilitation, and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "ACC focuses on the development of students, committed to introducing them to the ever-changing information and technology world of today. They are working with a vision to create leaders in the emerging technology sector, preparing them for the as the future pioneering trailblazers of the future."
    },
    {
        "id": "5",
        "name": "AIUB DRAMA CLUB (ADC)",
        "img": "https://www.aiub.edu/Files/Uploads/original/adc.png",
        "objective": "ADC aims to provide students with the opportunity to explore their creative talents in theatre stage plays, since its inception in 2004. The club encourages students to explore their artistic talents, provide a forum for members to share their work, and foster a sense of community that can come together to bring stories of inspiration, tragedy, and heritage to life.",
        "activites": "From acting classes, scriptwriting workshops, stagecraft sessions, ADC focuses on developing the caliber of its members, in order to create thought-provoking stage plays in a theatre format, emphasizing on historical events like the Liberation War and Bengali Language Movement, social issues like gender discrimination and social inequality, as well as comical satires and global events. Their performances have been showcased both within the university as well as externally in noteworthy institutions like the Bangladesh Shilpokala Academy over the years.",
        "membership": "Membership of ADC is open to students from all 4 Faculties of the university, who are interested in theatre and stage plays. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 30 proactive members working at ADC.",
        "leadership": "ADC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance, logistical facilitation, and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "ADC plans to expand its offerings in the future by partnering with local theaters and arts organizations. The club hopes to be able to offer more workshops, as well as opportunities for students to write and produce their own plays. Through constructive collaboration, ADC looks forward to gaining access to a strong network of professionals and utilizing resources to realize their prospects in drama."
    },
    {
        "id": "6",
        "name": "AIUB ENGLISH CLUB(AEC)",
        "img": "https://www.aiub.edu/Files/Uploads/aiub-english-club.png",
        "objective": "Established in 2023, the purpose of the AIUB English Club (AEngC) is to provide students with an engaging environment where they can learn about the English language, its literary work, and its usage as a medium of communication. Through diverse activities and collaborative projects, members can work on practicing and improving their listening, speaking, reading, and writing skills, to build confidence and competence in public speaking, presentations, debates, creative writing, editorials, etc.",
        "activites": "Besides their regular general meetings and member recruitment campaigns, the AEngC arranges interactive discussion sessions for its members, workshops focusing on various aspects speaking, reading, listening, and writing, public speaking events, collaborative writing projects, etc., geared towards encouraging and enabling students to proactively work on improving their dexterity on the English language.",
        "membership": "Although AEngC is considered as a departmental club of the Faculty of Arts & Social Sciences (FASS), students from all 4 Faculties of the university, who are interested in enhancing their skills and knowledge of the English language, are welcome to join AEngC. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 130 proactive members working at AEngC.",
        "leadership": "AEngC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance, logistical facilitation, and constant support to the EC for implementing the various events of the club, in collaboration with the Department of English in FASS.",
        "future_outlook": "The club aims to become a vibrant and integral part of the student community, creating a platform that can aid in developing their understanding and proficiency in English. AEngC intends to explore collaborative partnerships with various local organizations that work on English language programs or have resources/expertise in the field of public speaking, presentations, professional writing, etc. in order to provide mentorship and enrich the club’s workshops and seminars further. The goal is to then engage in national and regional competitions, by participating as well as organizing the events in the future."
    },
    {
        "id": "7",
        "name": "AIUB ENVIRONMENT CLUB",
        "img": "https://www.aiub.edu/Files/Uploads/aiub-environment-club.png",
        "objective": "With the increasing changes of global warming, since its inception in 2023, the AIUB Environment Club (AEC) works towards protecting and preserving the environment for future generations, creating a world where humans live in harmony with nature. AEC aims to spread awareness about climate change to all the students, offering students the opportunity to serve their community and expand their skills in the process.",
        "activites": "The club engages in initiatives through a nationwide network of various institutions working towards preserving and protecting the environment. Ranging from rallies to seminars and tree plantation campaigns, AEC focuses on educating the general student community, along with the general society, on crucial environmental issues, their impact on our lives, and how to resolve them in the long run. The club focuses on promoting awareness about environmental degradation including plastic production, excessive use of plastic made items, water and air pollution, deforestation, recycling and erosion in all the regions of Bangladesh.",
        "membership": "Membership of AEC is open to students from all 4 Faculties of the university, who are interested in working for the protection and preservation of the environment. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 100 proactive members working at AEC.",
        "leadership": "AEC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "AEC will continue addressing the challenges of climate change and spreading awareness, along with taking initiatives to collaborate with various organizations in order to reduce pollution and greenhouse gas emissions from the industries and traffic congestion, protect endangered species of plants, wildlife, and habitats, and of course, promote sustainable development of the environment around us for the years to come."
    },
    {
        "id": "8",
        "name": "AIUB ECONOMICS CLUB",
        "img": "https://placehold.co/460x320?font=lato&text=AEqC",
        "objective": "The AIUB Economics Club (AEqC), established in 2014, aims to create a stimulating environment for students to enrich their understanding of economic principles and their applications, foster critical thinking, analytical abilities, and problem-solving skills, through various engaging activities that connect theories to real-world scenarios, enabling members to learn to take well-informed decisions in their future careers.",
        "activites": "At the AEqC, interactive sessions with guest speakers, faculty discussions, along with presentations and workshops on economic concepts are organized on a regular basis, for the members and general student community to understand real-world scenarios better. Seminars and study tours are also arranged by the club that explore external institutions and their implications on the world economy in the long run, as well as highlight prospective opportunities for one’s career path in the field, home and abroad.",
        "membership": "The AEqC is considered as a departmental club with its membership being exclusively for the students from the Department of Economics in the Faculty of Arts & Social Sciences (FASS), emphasizing on those who intend to take up professional ventures in the field of economics, either in Bangladesh or across borders. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 140 proactive members working at AEqC.",
        "leadership": "AEqC operates under the supervision of the Office of Student Affairs (OSA), together with the Department of Economics in FASS, following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "The club aims to become a leading resource for students on campus, interested in learning and enhancing their skills and knowledge in the economics sector. AEqC intends to be able to engage its members in stock market simulations, investment competitions, and policy discussions that can shape their ideas and impact on the local, national, regional, and even global scale in the years to come."
    },
    {
        "id": "9",
        "name": "AIUB FILM CLUB(AFC)",
        "img": "https://www.aiub.edu/Files/Templates/NewAIUB/assets/images/onCampus/afc.png",
        "objective": "Established in 2009, the purpose of the AIUB Film Club (AFC) is to provide a forum for students to discuss and learn about filmmaking. Their aim is to promote culture through the camera, sharing the creative talent of bringing stories to life through a network of people passionate about learning and engaging in the art of filmmaking.",
        "activites": "AFC primarily works on creating short films covering various social issues, cultural aspects, and student life, while arranging film shows to as a form of recreational activity for the student community and to expose them to a broad spectrum of movies, ranging from Bengali, English, and even Korean. The club also conducts workshops for their members to better train them in the process of filmmaking, as directors, script writers, cinematographers, set designers, production managers, editors, actors, etc. AFC both organizes and participates in a number of different film festivals, competing in short films, where they have made several achievements with original stories, along with a number of different launch events and activations for the premier or screening of noteworthy releases of Bangladeshi cinema.",
        "membership": "Membership of AFC is open to students from all 4 Faculties of the university, who are interested in the art of filmmaking. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 80 proactive members working at AFC.",
        "leadership": "AFC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "With an aim to increase students’ appreciation of filmmaking as an art form, AFC will continue to provide opportunities for students to learn, analyze, and create films, as well as collaborating with various organizations of the film industry in Bangladesh to present and promote culture, through life stories in frames."
    },
    {
        "id": "10",
        "name": "AIUB ORATORY CLUB",
        "img": "https://www.aiub.edu/Files/Templates/NewAIUB/assets/images/onCampus/aoc.png",
        "objective": "The AIUB Oratory Club (AOC) was established in 2000 with the aim of providing students with the opportunity to develop their communications skills through the practice of debating. AOC focuses on equipping students with a platform to hone their critical thinking, research capabilities, articulation and diction in the format of oration.",
        "activites": "Enabling and encouraging public speaking, AOC conducts a number of different workshops and competitions that are geared towards helping students develop their abilities of problem-solving, quick-thinking, and brainstorming. The club participates and organizes national debate championships, in both formats of Bengali and English, within the university as well as on a national level. AOC undertakes initiatives to improve aspects of presentation, negotiation, and leadership amongst its members and the general student body.",
        "membership": "Membership of AOC is open to students from all 4 Faculties of the university, who are interested in debate and public speaking. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 89 proactive members working at AOC.",
        "leadership": "AOC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "AOC plans to create a diverse set of programs that will prepare students with skills needed to succeed in competitive environments. Through collaborations with alumni members of the debating fraternity, AOC will devise a diverse set of programs aimed towards engaging youth leadership, create socio-political awareness, and constructive team building that stimulates stronger democracy, unity, and empathy."
    },
    {
        "id": "11",
        "name": "AIUB MOOT COURT CLUB(AMCC)",
        "img": "https://www.aiub.edu/Files/Uploads/aiub-moot-court-club-logo.png",
        "objective": "Established in 2023, the AIUB Moot Court Club (AMCC) with the aim to cultivate a stimulating environment where students can develop exceptional legal research, writing, and advocacy skills through moot court competitions. AMCC fosters critical thinking, analytical reasoning, and persuasive communication in a competitive legal setting, providing opportunities for students to gain practical courtroom experience and build confidence in public speaking, while promote a deeper understanding of legal principles and their application in contemporary legal issues.",
        "activites": "AMCC arranges weekly workshops on legal research strategies, case analysis, and oral advocacy techniques and internal moot court competitions simulating real-world court proceedings, allowing students to hone their litigation skills. Members also participate in regional, national, and international moot court competitions, representing AIUB on a prestigious platform. The club also organizes guest speaker sessions featuring legal professionals, judges, or prominent lawyers sharing insights from the legal field along with conducting mock client consultations and negotiation exercises to develop client communication and problem-solving skills. AMCC offers its members and alumni networking opportunities with alumni working in the legal profession and potential employers.",
        "membership": "AMCC is considered as a departmental club for the Department of Law under the Faculty of Arts & Social Sciences (FASS). Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 77 proactive members working at AMCC.",
        "leadership": "AMCC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "AMCC aims to be a premier organization for aspiring legal professionals at AIUB. T The club plans to collaborate with local law firms, legal aid organizations, or judicial chambers can expose members to practical legal applications, organize on-campus legal workshops or seminars for the wider student body can expand the club's reach and promote legal awareness, and building a strong alumni network can provide mentorship and career opportunities for current and future members."
    },
    {
        "id": "12",
        "name": "AIUB PERFORMING ARTS CLUB",
        "img": "https://www.aiub.edu/Files/Uploads/apac.jpg",
        "objective": "Established in 1998, the AIUB Performing Arts Club (APAC) aims to provide students with a platform to channel their creativity through music and dance. APAC promotes our cultural heritage through traditional Bengali songs and dance forms, while expanding their exposure through experiencing and experimenting with a diverse set of foreign genres, encouraging young talents to pursue their dreams in performing arts.",
        "activites": "APAC organizes and participates in all the cultural events of the university, arranging musical and dance performances in programs of their own initiatives as well as those of other student organizations, academic departments, and the university as a whole. The club also conduct workshops with established artists of the industry, along with festival celebrations like the Bengali New Year and even tribute events on the occasion of the Independence Day. The club encompasses a talented pool of singers, dancers, musicians, designers, reciters, and capable organizers with a history of achievements on and off the stage. APAC participates in external musical competitions while organizing their own flagship events, collaborating with numerous organizations, in order to encourage young musicians and dancers to develop their skills and uphold the music-rich culture in the global landscape.",
        "membership": "Membership of APAC is open to students from all 4 Faculties of the university, who are interested in music and dance. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 132 proactive members working at APAC.",
        "leadership": "APAC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "In the coming years, the APAC plans to expand its offerings to include more hands-on and constructive workshops with upcoming artists and industry icons, as well as engage in more community outreach events and inter-club collaborations. The club also plans to enhance and expand their flagship events of the workshop series and musical competition, in addition to ensuring university-wide productions every semester."
    },
    {
        "id": "13",
        "name": "AIUB FOREGIN STUDENTS ASSOCIATION ",
        "img": "https://www.aiub.edu/Files/Uploads/19265.jpg",
        "objective": "The AIUB Foreign Students Association (AFSA), established in 2009 aims to provide a welcoming and supportive community for international students at AIUB, to foster cultural exchange by building compatible understanding between foreign and local students. AFSA assists international students in adapting to life in Bangladesh and the university, while exposing them to real-world scenarios that encourage teamwork, promote leadership, and explore opportunities of engagement within the general student body.",
        "activites": "AFSA acts as a platform that enables foreign students to arrange socio-cultural events, celebrating diverse traditions from various parts of the world. This enables them to interact not only amongst themselves, but also within the student club community and general students as well. Existing student members can also orient them into the campus life, university procedures, academic processes, resources and facilities, along Bangladeshi culture here at AIUB. They provide mentorship programs, pairing new foreign students with senior international students and other club members, who offer guidance and support to each other. AFSA also collaborates with other student organizations and the university administration for workshops, seminars, and several other co-curricular activities on campus.",
        "membership": "Membership of AFSA is open to international students from all 4 Faculties of the university. All foreign students enrolled at AIUB are automatically offered membership in AFSA. The number of proactive members in AFSA varies from semester to semester, depending on the international student enrollment and exchange programs running at any given time at AIUB.",
        "leadership": "AFSA operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "With an aim to increase students’ appreciation of filmmaking as an art form, AFC will continue to provide opportunities for students to learn, analyze, and create films, as well as collaborating with various organizations of the film industry in Bangladesh to present and promote culture, through life stories in frames."
    },
    {
        "id": "14",
        "name": "AIUB PHOTOGRAPHY CLUB",
        "img": "https://www.aiub.edu/Files/Templates/NewAIUB/assets/images/onCampus/apc.png",
        "objective": "The AIUB Photography Club (AIUBPC) has been dedicated to the art and practice of photography since its inception in 2005. The club aims to provide students with opportunities to learn about the basics of photography, develop their skills, share their work by collaborating with a network of professional photographers.",
        "activites": "The AIUBPC organizes workshops to improve techniques on composition, lighting, and exposure of the various genres of photography. From field trips to local photographic locations to in-depth discussion critiquing members’ work, the club arranges and participates in a number of different photography competitions and exhibitions, within and outside of AIUB. Members showcase their work on international platforms, while gaining submissions in their events from across the globe as well. The club also undertakes the responsibility of providing photography and videography support in events at the university, along with programs of other student organizations, voluntarily, adding a significant collaborative value as a part of the student community.",
        "membership": "Membership of AIUBPC is open to students from all 4 Faculties of the university, who are interested in photography. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 170 proactive members working at AIUBPC.",
        "leadership": "AIUBPC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "AIUBPC will expand its scope through additional field trips, workshops, exhibitions, and competitions, building a stronger online presence to utilize digital platforms to increase reach. The club will explore new avenues of photography, beyond the existing lines of event, mobile, portrait, and street photography, focusing on areas like photojournalism, macro, wildlife, and commercial photography, etc. Engaging in mutually beneficial partnerships with industry experts, AIUBPC will not only enhance their capabilities, but their capacities for a career in photography through mentorships with professional photographers as well."
    },
    {
        "id": "15",
        "name": "AIUB SOCIAL WELLFARE CLUB - SHOMOY",
        "img": "https://www.aiub.edu/Files/Templates/NewAIUB/assets/images/onCampus/asc.png",
        "objective": "Established in 2009, the AIUB Social Welfare Club – Shomoy (ASC), aims to provide students with opportunities to learn about social welfare issues, volunteer their time to help others, and develop leadership skills. ASC works towards educating students on concerns like poverty, gender discrimination, food insecurity, etc., creating awareness on the sustainable development goals (SDGs). They work towards building a community of change-makers and motivating the youth to take action through volunteerism, fundraisers, and advocacy, making a difference in the world.",
        "activites": "ASC focuses on volunteering for social causes ranging from flood relief, blood donations, winter clothing drives, self-defense, and various other charitable work. The club collaborates with numerous non-governmental organizations (NGOs) to further pursue social welfare for a larger community. From teaching and training at a local school for underprivileged children to raising funds for providing rations to them on Eid, and even running campaigns for critically diagnosed patients of the AIUB community, supporting the university’s community service initiatives, ASC shapes future leaders to help bring about a positive change to develop the society.",
        "membership": "Membership of ASC is open to students from all 4 Faculties of the university, who are interested in photography. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 126 proactive members working at ASC.",
        "leadership": "ASC operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "With the hope of having a greater impact on future generations, ASC will expand its volunteer work to address more SDGs in the coming years, increase its fundraising efforts to support additional social welfare campaigns, develop mentorship opportunities together with local and international development organizations, and leadership initiatives to create a better place for tomorrow."
    },
    {
        "id": "16",
        "name": "AIUB RESEARCH FOR DEVELOPMENT CLUB",
        "img": "https://www.aiub.edu/Files/Uploads/aiub-red-logo.png",
        "objective": "Established in 2023, the AIUB Research for Development Club (AIUBReD) focuses on research, development, and innovation (RDI) among AIUB students across all disciplines. It cultivates a collaborative learning environment where students can develop critical thinking, problem-solving, and research methodologies. In order to nurture future researchers and innovators by providing opportunities to translate theoretical knowledge into practical solutions, AIUBReD works on bridging the gap between academia and industry by fostering connections with external stakeholders.",
        "activites": "AIUBReD arranges research paper presentations, poster sessions, and symposiums showcasing members’ research within the university community. They organize workshops and seminars on topics like research design, data analysis, scientific writing, and intellectual property. The club explores industry collaborations by partnering with companies, NGOs, or research institutions for internship opportunities, guest lectures, and real-world research projects. AIUBBReD connects experienced researchers from the different faculties as well as skilled industry professionals with student members as a knowledge-sharing platforms, for them to share research findings and engage in intellectual discourse.",
        "membership": "Membership of AIUBReD is open to students from all 4 Faculties of the university, who are interested in research in any field. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 140 proactive members working at AIUBReD",
        "leadership": "AIUBReD operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "AIUBReD aspires to become a leading platform for nurturing future generations of Bangladeshi researchers and innovators. The club will establish a strong alumni network that can provide career guidance, mentorship, and potential research collaborations for current members. Eventually, they will be participating in national and international research conferences, showcasing the AIUBReD’s achievements and connect students with a broader research network, advocating for increased research funding and infrastructure development within AIUB can further support student research endeavors."
    },
    {
        "id": "17",
        "name": "AIUB ROBOTIC CREW",
        "img": "https://www.aiub.edu/Files/Templates/NewAIUB/assets/images/onCampus/arc.png",
        "objective": "AIUB Robotic Crew (ARC) is a team of undergraduate students from American International University-Bangladesh (AIUB) who is passionate about the field of robotics. The team was formed with the purpose to compete in the University Rover Challenge (URC), an annual international robotics tournament for college students held Utah, USA since its inception in 2006. ARC started off as a young team (mostly 3rd year undergraduates) with little experience but they have made up for it with their passion to learn and excel in pursuing their dreams. The team was formed around the beginning of 2015 and soon got approval from their university to initiate their involvement in the competition, and have successfully participated in the competition as one of the teams selected and invited from Bangladesh 4 times in a row (2015-18) amongst the Top 36 Finalists at the URC. Even though hundreds of students were initially interested, the team had to be filtered down to only 18 of the best. The team comprises of 14 bright and hardworking students from the Electrical and Electronics Engineering Department of AIUB and 4 exceptionally talented stalwarts from the Computer Science Department of AIUB. Some of these members had participated in robotics and programming contests and won national awards. Even with such diverse backgrounds and disciplines, the members of ARC share one common goal and that is to represent themselves, their alma mater and their nation, at the highest platform. With strong determination and work ethics, this team has grown in strength and confidence exponentially over time. They believe that through this opportunity they will be part of something special and inspire the future generations to follow in their footsteps."
    },
    {
        "id": "18",
        "name": "AIUB VOLUNTEER UNIT",
        "img": "https://www.aiub.edu/Files/Uploads/aiub-volunteer-unit-logo.png",
        "objective": "The AIUB Volunteer Unit was established in 2001 to cultivate a spirit of unity, responsibility and support amongst AIUB students by providing a platform for students to develop valuable skills and gain practical experience by assisting the OSA and other university departments with administrative, logistical, and event-related tasks. The Volunteer Unit fosters a sense of community spirit and encourages student engagement in the university's operations, cultivating leadership, teamwork, communication, and problem-solving skills through participation in diverse volunteer activities. The unit offers opportunities for personal growth and professional development in a supportive university environment.",
        "activites": "The Volunteer Unit undertakes administrative support by assisting OSA with tasks such as data entry, scheduling meetings, managing registration processes, or preparing informational materials for student events. They are also involved in university events like orientation programs, career fairs, guest lectures, or cultural celebrations, supporting logistics, set-up, and participant management as volunteers. Their experience acts as skill-building workshops and training sessions on communication, teamwork, time management, and problem-solving to enhance volunteer effectiveness.",
        "membership": "Membership to the Volunteer Unit is open to students from all 4 Faculties of the university, who are interested in volunteering their support for the university. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the unit. Currently, there are 40 proactive members working in the Volunteer Unit.",
        "leadership": "The Volunteer Unit operates under the supervision of the Office of Student Affairs (OSA), with senior volunteers placed in-charge for the remaining duration of their studentship (which is usually 1-2 years). OSA provides overall guidance and constant support to the unit for conducting the various activities of the university.",
        "future_outlook": "The AIUB Student Volunteer Unit aspires to be a valuable resource for the university community, contributing to the smooth functioning of events and administrative processes. The unit plans to work towards building strong relationships with various university departments can ensure a continuous stream of diverse volunteer opportunities and establishing an alumni network of former volunteers can provide mentorship and potential career guidance for current members. The Volunteer Unit will be advocating for the integration of volunteer experiences into academic programs that can further enhance student development and engagement within AIUB."
    },
    {
        "id": "19",
        "name": "AIUB ENGINEERING STUDENTS OF BANGLADESH - AIUB UNIT FACE(ESAB)",
        "img": "https://www.aiub.edu/Files/Uploads/original/esab-logo-300x163.png",
        "objective": "Engineering Students' Association of Bangladesh (ESAB) is a non-profit organization for helping engineering students to explore their inner potential and talent. ESAB’s target is the collaboration of Engineering Students Society of Bangladesh for the welfare of the country. ESAB AIUB Unit Face operates as a part of the organization.",
        "activites": "ESAB AIUB Unit Face arranges constructive seminars and workshops focusing on the latest technological advancements around the world, creating a platform to deliberate on existing challenges and determine resolutions for the future. The sessions focus on emerging engineering trends to encourage students to acquire knowledge beyond the classroom while engaging in practical applications of modern solutions in the field of engineering infrastructure.",
        "membership": "Membership of ESAB AIUB Unit Face is open to students from the Faculty of Engineering (FE) and the Faculty of Science & Technology (FST). Recruitments are conducted in alternate semesters, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 200 proactive members working at ESAB AIUB Unit Face.",
        "leadership": "ESAB AIUB Unit Face operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC), with corresponding designations reflecting the department. OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "ESAB has been working towards making an open platform for the engineering students of Bangladesh where they can have the opportunity to implement their ideas and pursue their talents. ESAB will be undertaking further initiatives to build a strong community network where the engineering students can share interests and explore potential strategic designs proposed by new generation engineers to address challenges of the society and contribute in achieving the targets of the Sustainable Development Goals (SDGs)."
    },
    {
        "id": "20",
        "name": "DUKE OF EDINBURGH AWARDS PROGRAM",
        "img": "https://www.aiub.edu/Files/Uploads/medium/dea-aiub-logo.png",
        "objective": "The Duke of Edinburgh Awards Program (DEA) is a non-formal education and learning framework operating in more than 130 countries and territories around the world, through which young people’s achievements outside of academia are recognized and celebrated. It initiated in Bangladesh, through AIUB, in 2008. The award aims to empower young people (ages 14-24) to develop essential life skills and build confidence, foster well-rounded individuals through a holistic program encompassing volunteering, physical activity, skills development, and adventurous journeys at the bronze, silver, and gold level.",
        "activites": "DEA provides a personalized and engaging experience allowing participants to set their own goals and choose activities aligned with their interests that enhances employability by equipping young people with valuable skills sought after in the workplace, while promoting a sense of social responsibility and encourage positive contributions to the community. Participants first choose volunteer activities that align with their interests, contributing to the well-being of their community. Then they engage in a chosen sport, fitness program, or outdoor activity to develop physical fitness and discipline. Participants also select a skill to learn and develop, such as music, technology, languages, or creative arts. And finally, they undertake an adventurous journey, which is a planned, self-supported expedition, promoting teamwork, navigation, and problem-solving skills in an outdoor environment (varies in time duration and intensity depending on the bronze, silver, or gold level).",
        "leadership": "DEA operates under the Office of Sports (OS), with the supervision of the Office of Student Affairs (OSA), with senior volunteers placed in-charge for the remaining duration of their studentship (which is usually 1-2 years). OSA provides overall guidance and constant support to the unit for conducting the various activities of the university.",
        "future_outlook": "DEA aims to continue expanding its reach, empowering more young people globally, developing partnerships with educational institutions can enhance program accessibility for students and incorporating digital tools and online platforms can facilitate program management, communication, and resource sharing. The program is continuously exploring innovative activities and challenges that can ensure the program remains relevant and engaging for future generations."
    },
    {
        "id": "21",
        "name": "IEEE AIUB STUDENT BRANCH ",
        "img": "https://www.aiub.edu/Files/Templates/NewAIUB/assets/images/onCampus/ieesb.png",
        "objective": "Since its inception in 2006, the primary aim and objectives of IEEE are centered on fostering knowledge sharing, collaboration, and the establishment of standards within the worldwide technical community. Operating as an official IEEE Student Branch, the mission of the IEEE AIUB Student Branch (SB) is to extend STEM initiatives across the nation and beyond. This is accomplished through engaging educational and technical events, as well as networking opportunities. Additionally, the branch strives to leverage technology to address humanitarian challenges and further its applications and promote the international scientific community of IEEE.",
        "activites": "The IEEE AIUB SB is committed to the advancement in technology, spreading knowledge, and engaging with the community through a broad range of activities. The branch provides its members with the opportunity to stay up to date on cutting-edge research and trends in different fields of engineering, electronics, and computer science through a variety of workshops, seminars, and technical sessions. These exercises not only broaden their learning but also enable them to come up with innovative solutions for real-world issues. Additionally, the branch reaches out to the broader community through activities that promote the use of technology for humanitarian objectives. Furthermore, the branch encourages networking and collaboration among students, professionals, and researchers, building a community based on shared wisdom and collaborative efforts. Because of their exceptional performance, reach, and impact, the IEEE AIUB SB has been one of the largest and most successful student branches since its inception in Bangladesh and has been awarded the ‘IEEE Regional Exemplary Student Branch Award’ consecutively four times in the entire Asia-Pacific Region also known as Region 10.",
        "membership": "Membership of IEEE AIUB SB is open to students from the Faculty of Engineering (FE) and the Faculty of Science & Technology (FST), who have a keen interest in expanding and exchanging their knowledge of engineering, technology, and digital development. Recruitments are conducted annually, through which applicants are evaluated, interviewed, and selected to join the club. Currently, there are 155 proactive members and 38 volunteers and executive committee members working at IEEE AIUB SB.",
        "leadership": "IEEE AIUB Student Branch operates under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "IEEE AIUB SB believes that the synergy created through cooperation and partnership outweighs the merits of any personal accomplishment. Building on a solid foundation of collaboration, technological growth, and a beneficial effect on society, the branch will continue to make an even greater impact. The objective is to keep connecting professionals, learners, and researchers, delivering a vibrant environment for sharing ideas and knowledge. The IEEE AIUB SB hopes to keep on top of addressing real-world challenges with novel technological solutions, aiming for a future of excellence, progress, and positive change to the community."
    },
    {
        "id": "22",
        "name": "IEOM SOCITY INTERNATIONAL AIUB STUDENT CHAPTER",
        "img": "http://ieomsociety.org/ieom/wp-content/uploads/2012/07/ieomsocietybannernew900.png",
        "objective": "Established in 2006, the purpose of the AAC is to provide students with an opportunity to explore their creativity and artistic talents. The club aims to encourage students to explore their artistic talents, provide a platform for students to share their work with others, promote creativity and foster a sense of community among them.",
        "activites": "IEOM AIUB SC arranges informative seminars and workshops focusing on technology management, which will help to create the platform to deliberate on existing challenges and determine resolutions for the future. IEOM AIUB SC undertakes various initiatives to establish collaboration between academia and industry, as well as planning and organizing industrial trainings and tours to enrich the knowledge of members on latest technologies relevant to their fields of study.",
        "membership": "Membership of IEOM AIUB SC is open to students from Faculty of Engineering (FE) and Faculty of Business Administration (FBA) of the university. Recruitments are conducted during the semesters, through which applicants are evaluated, interviewed, and selected to join the club.",
        "leadership": "IEOM AIUB SC will be operated under the supervision of the Office of Student Affairs (OSA), following the general structure for the Executive Committee (EC). OSA provides overall guidance and constant support to the EC for implementing the various events of the club.",
        "future_outlook": "IEOM AIUB SC plans to work on making an open platform for the students of Faculty of Engineering (FE) and Faculty of Business Administration (FBA) across Bangladesh and abroad, where they can have the opportunity to implement their ideas and explore their talents, while building a strong community network."
    }
]